olliw42/stm32ll-lib/stdstm32-uart-template.h
void uart$_puts(const char *s)
{
  while (*s) {
    uart$_putc(*s);
    s++;
  }
}


void uart$_putbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) uart$_putc(buf[i]);
}


#ifdef UART$_USE_TX_ISR
uint16_t uart$_tx_notfull(void)
{
  uint16_t next = (uart$_txwritepos + 1) & UART$_TXBUFSIZEMASK;
  return (uart$_txreadpos != next); // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
}


static inline uint16_t uart$_tx_isempty(void)
{
  if (uart$_txwritepos == uart$_txreadpos) return 1;
  return 0;
}


static inline void uart$_tx_flush(void)
{
  uart$_txwritepos = uart$_txreadpos = 0;
}
#else
static inline void uart$_tx_flush(void) {}
#endif

#endif // defined UART$_USE_TX


//-------------------------------------------------------
// RX routines
//-------------------------------------------------------
#ifdef UART$_USE_RX

static inline uint16_t uart$_rx_available(void)
{
  if (uart$_rxwritepos == uart$_rxreadpos) return 0; // fifo empty
  return 1;
}


uint16_t uart$_rx_bytesavailable(void)
{
int16_t d;

  d = (int16_t)uart$_rxwritepos - (int16_t)uart$_rxreadpos;
  return (d < 0) ? d + (UART$_RXBUFSIZEMASK + 1) : d;
}


char uart$_getc(void)
{
  while (uart$_rxwritepos == uart$_rxreadpos) {};
  uart$_rxreadpos = (uart$_rxreadpos + 1) & UART$_RXBUFSIZEMASK;
  return uart$_rxbuf[uart$_rxreadpos];
}


static inline char uart$_lookatnextc(void)
{
  return uart$_rxbuf[(uart$_rxreadpos + 1) & UART$_RXBUFSIZEMASK];
}


static inline void uart$_rx_flush(void)
{
  uart$_rxwritepos = uart$_rxreadpos = 0;
}

#endif // defined UART$_USE_RX


//-------------------------------------------------------
// INIT routines
//-------------------------------------------------------
// ATTENTION:
// LPUART does not support 0.5 or 1.5 stop bits !!

// helper, usually should not be called itself
void _uart$_initprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UART$_USE_LPUART1 || defined UART$_USE_LPUART1_REMAPPED)
LL_USART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != XUART_PARITY_NO) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  UART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
#if defined STM32G4
  UART_InitStruct.PrescalerValue = LL_USART_PRESCALER_DIV1;
#endif

  LL_USART_Init(UART$_UARTx, &UART_InitStruct);
#else
LL_LPUART_InitTypeDef UART_InitStruct = {};

  UART_InitStruct.BaudRate = baud;
  UART_InitStruct.DataWidth = (parity != LL_USART_PARITY_NONE) ? LL_LPUART_DATAWIDTH_9B : LL_LPUART_DATAWIDTH_8B;
  UART_InitStruct.StopBits = stopbits;
  UART_InitStruct.Parity = parity;
  UART_InitStruct.TransferDirection = LL_LPUART_DIRECTION_TX_RX;
  UART_InitStruct.HardwareFlowControl = LL_LPUART_HWCONTROL_NONE;
  UART_InitStruct.PrescalerValue = LL_LPUART_PRESCALER_DIV1;

  LL_LPUART_Init(UART$_UARTx, &UART_InitStruct);
#endif
}


void uart$_setprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
#if !(defined UART$_USE_LPUART1 || defined UART$_USE_LPUART1_REMAPPED)
  LL_USART_Disable(UART$_UARTx); // must be disabled to configure some registers
  _uart$_initprotocol(baud, parity, stopbits);
  LL_USART_Enable(UART$_UARTx);
#else
  LL_LPUART_Disable(UART$_UARTx); // must be disabled to configure some registers
  _uart$_initprotocol(baud, parity, stopbits);
  LL_LPUART_Enable(UART$_UARTx);
#endif
}


void uart$_setbaudrate(uint32_t baud)
{
  uart$_setprotocol(baud, XUART_PARITY_NO, UART_STOPBIT_1);
}


void uart$_tx_enablepin(FunctionalState flag)
{
#ifdef UART$_USE_TX
  if (flag == ENABLE) {
    gpio_change_af(UART$_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UART$_IO_AF, IO_SPEED_VERYFAST);
  } else {
    gpio_change(UART$_TX_IO, IO_MODE_INPUT_ANALOG, IO_SPEED_VERYFAST);
  }
#endif
}


void uart$_rx_enableisr(FunctionalState flag)
{
#ifdef UART$_USE_RX
  if (flag == ENABLE) {
    // Enable Receive Data register not empty interrupt
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UART$_UARTx);
#endif
    LL_USART_ReceiveData8(UART$_UARTx); // read DR to clear RXNE and error flags
    LL_USART_EnableIT_RXNE(UART$_UARTx);
  } else {
    LL_USART_DisableIT_RXNE(UART$_UARTx);
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UART$_UARTx);
#endif
  }
#endif
}


void uart$_init_isroff(void)
{
  LL_USART_Disable(UART$_UARTx);

  // Initialize clocks for USART/LPUART, GPIO, AFIO
  rcc_init_afio();
  rcc_init_uart(UART$_UARTx);
#ifdef STM32F1
#if defined UART$_USE_UART1_REMAPPED
  LL_GPIO_AF_EnableRemap_USART1();
#endif
#if defined UART$_USE_UART2_REMAPPED
  LL_GPIO_AF_EnableRemap_USART2();
#endif
#if defined UART$_USE_UART3_REMAPPED
  LL_GPIO_AF_RemapPartial_USART3();
#endif
#endif // STM32F1

  // Configure pin USART/LPUART Tx as alternative function push-pull
#ifdef UART$_USE_TX
  gpio_init_af(UART$_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UART$_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure pin USART/LPUART Rx as input with pull up
#ifdef UART$_USE_RX
#ifndef UART$_INVERTED
  gpio_init_af(UART$_RX_IO, IO_MODE_INPUT_PU, UART$_IO_AF, IO_SPEED_VERYFAST);
#else
  gpio_init_af(UART$_RX_IO, IO_MODE_INPUT_PD, UART$_IO_AF, IO_SPEED_VERYFAST);
#endif
#endif

  // Configure USART/LPUART
  _uart$_initprotocol(UART$_BAUD, XUART_PARITY_NO, UART_STOPBIT_1);
#if !(defined UART$_USE_LPUART1 || defined UART$_USE_LPUART1_REMAPPED)
  LL_USART_ConfigAsyncMode(UART$_UARTx);
#if defined STM32G4
  LL_USART_DisableFIFO(UART$_UARTx);
  LL_USART_SetTXFIFOThreshold(UART$_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
  LL_USART_SetRXFIFOThreshold(UART$_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
#endif
#else
  LL_LPUART_DisableFIFO(UART$_UARTx);
  LL_LPUART_SetTXFIFOThreshold(UART$_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
  LL_LPUART_SetRXFIFOThreshold(UART$_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
#endif

