olliw42/stm32ll-lib/stdstm32-uart-template.h
#ifdef UART$_INVERTED
#ifdef UART$_USE_TX
  LL_USART_SetTXPinLevel(UART$_UARTx, LL_USART_TXPIN_LEVEL_INVERTED);
#endif
#ifdef UART$_USE_RX
  LL_USART_SetRXPinLevel(UART$_UARTx, LL_USART_RXPIN_LEVEL_INVERTED);
#endif
#endif

  // Configure NVIC channel
#if defined UART$_USE_RX || defined UART$_USE_TX_ISR
#ifdef UART$_PREEMPTIONPRIORITY
  #error Legacy UART$_PREEMPTIONPRIORITY used !
#endif
#ifdef UART$_SUBPRIORITY
  #error Legacy UART$_SUBPRIORITY used !
#endif
#ifdef UART$_PRIORITY
#error Legacy UART$_PRIORITY used !
#endif
#ifndef UART$_IRQ_PRIORITY
  #define UART$_IRQ_PRIORITY  15 // set priority to lowest
#endif
  nvic_irq_enable_w_priority(UART$_IRQn, UART$_IRQ_PRIORITY);
#endif

#ifdef UART$_USE_TX_ISR
  // Disable Transmit Data Register empty interrupt
  LL_USART_DisableIT_TXE(UART$_UARTx);
  LL_USART_DisableIT_TC(UART$_UARTx);
  LL_USART_ClearFlag_TC(UART$_UARTx);
  // Flush buffer
  uart$_txwritepos = uart$_txreadpos = 0;
#endif

#ifdef UART$_USE_RX
  // Disable Receive Data register not empty interrupt
  LL_USART_DisableIT_RXNE(UART$_UARTx);
#ifdef STM32F1
  LL_USART_ClearFlag_RXNE(UART$_UARTx);
#endif
  // Flush buffer
  uart$_rxwritepos = uart$_rxreadpos = 0;
#ifdef UART$_USE_RXERRORCOUNT
  uart$_errorcnt_rxnoise = 0;
  uart$_errorcnt_rxframe = 0;
  uart$_errorcnt_rxoverrun = 0;
#endif
#endif

  // Cube HAL for f103rc
  /* In asynchronous mode, the following bits must be kept cleared:
     - LINEN and CLKEN bits in the USART_CR2 register,
     - SCEN, HDSEL and IREN  bits in the USART_CR3 register.*/
  CLEAR_BIT(UART$_UARTx->CR2, USART_CR2_CLKEN);
  CLEAR_BIT(UART$_UARTx->CR3, USART_CR3_HDSEL);
#if defined USART_CR2_LINEN
  CLEAR_BIT(UART$_UARTx->CR2, USART_CR2_LINEN);
#endif
#if defined USART_CR3_SCEN || defined USART_CR3_IREN // assume that always both are defined
  CLEAR_BIT(UART$_UARTx->CR3, (USART_CR3_SCEN | USART_CR3_IREN));
#endif

#if defined STM32F7
  // reading the F722 manual I've added this
  CLEAR_BIT(UART$_UARTx->CR1, (USART_CR1_EOBIE | USART_CR1_RTOIE | USART_CR1_CMIE | USART_CR1_PEIE | USART_CR1_IDLEIE));
  CLEAR_BIT(UART$_UARTx->CR2, (USART_CR2_RTOEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL | USART_CR2_LBDIE | USART_CR2_LBDL));
  CLEAR_BIT(UART$_UARTx->CR3, (USART_CR3_TCBGTIE | USART_CR3_CTSIE | USART_CR3_EIE));
#if !defined UART$_USE_RXERRORCOUNT
  // Disable ORE in the first place
  LL_USART_DisableOverrunDetect(UART$_UARTx); // disables ORE, check how F1 is behaving
#endif
#endif

#if defined STM32G4 || defined STM32F3 || defined STM32WL || defined STM32F0
#if !defined UART$_USE_RXERRORCOUNT
  LL_USART_DisableOverrunDetect(UART$_UARTx);
#endif
#endif

  // Enable USART/LPUART
  LL_USART_Enable(UART$_UARTx);

#if defined STM32G4 ||defined STM32F3 || defined STM32WL || defined STM32F0
  // Polling UART/LPUART initialisation
  while((!(LL_USART_IsActiveFlag_TEACK(UART$_UARTx))) || (!(LL_USART_IsActiveFlag_REACK(UART$_UARTx)))) {};
#endif
}


void uart$_init(void)
{
  uart$_init_isroff();
  uart$_rx_enableisr(ENABLE);
}


//-------------------------------------------------------
#ifdef __cplusplus
}
#endif
#endif // STDSTM32_UART$_H
